#ifndef TASK3_H            // перевіряю, чи цей файл вже підключали
#define TASK3_H            // якщо ні — "помічаю", що він підключений

#include <deque>           // підключаю deque (двостороння черга)

using namespace std;       // щоб не писати std::

template <typename T>     // шаблон, щоб працювало з будь-яким типом
bool isPalindrome(const deque<T>& d) {   // функція перевіряє, чи є deque паліндромом

    auto front = d.begin();        // ставлю вказівник на початок
    auto back = prev(d.end());     // ставлю вказівник на кінець (останній елемент)

    while (front < back) {         // поки не "зустрілись" посередині

        if (*front != *back) {     // якщо елементи з країв не рівні
            return false;          // значить це не паліндром
        }

        front++;   // рухаюсь вперед з початку
        back--;    // рухаюсь назад з кінця
    }

    return true;   // якщо все співпало — це паліндром
}

#endif            // кінець захисту від повторного підключення